Public Attributes | List of all members
API_DetailType Struct Reference
Element Manager API
Represents a detail/worksheet (detail/worksheet mark). More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | pen
Pen color attribute index of the detail's contour.
API_AttributeIndex  | ltypeInd
Line type attribute index of the detail's contour.
API_Coord  | pos
Coordinate of the base point. (See remarks)
double  | angle
The rotation angle (radian) of the marker symbol.
API_Guid  | markId
Guid of the marker symbol.
GS::uchar_t  | detailName [API_UniLongNameLen]
Name of the detail/worksheet (Unicode string, UTF-8 encoding).
GS::uchar_t  | detailIdStr [API_UniLongNameLen]
Reference ID of the detail/worksheet (Unicode string, UTF-8 encoding). If the text contains a '/' character, then the text is split between the beginning and end marks.
bool  | horizontalMarker
Marker symbol is always horizontal?
bool  | windOpened
Side (detail/worksheet) window is opened?
bool  | constructionElementsOnly
Copy construction elements only.
API_DatabaseUnId  | databaseID
Database ID to switch to (see API_DatabaseUnId).
API_Polygon  | poly
The clip polygon of the detail/worksheet.
API_MarkerLinkDataType  | linkData
The marker link data.
Detailed Description
Represents a detail/worksheet (detail/worksheet mark).
Remarks
Refer to the ACAPI_Database_ChangeCurrentDatabase function to access and operate on the corresponding Detail/Worksheet database. For detail related memo data see the ACAPI_Element_GetMemo function, and API_WorksheetType. Note that the origin of the coordinate system of a detail/worksheet database corresponds to the reference point location of the detail/worksheet element on the floor plan; thus elements on the detail/worksheet databases are offset by pos from their original location on the floor plan. Suppose the referencing detail/worksheet element was placed on a section/elevation window. In that case, the y coordinate on the detail/worksheet database equals to the y value of the section database to help working with the vertical (elevation) level. In this case, the pos.y data is ignored.
Member Data Documentation
◆ angle
 API_DetailType::angle
The rotation angle (radian) of the marker symbol.
◆ constructionElementsOnly
 API_DetailType::constructionElementsOnly
Copy construction elements only.
◆ databaseID
 API_DetailType::databaseID
Database ID to switch to (see API_DatabaseUnId).
◆ detailIdStr
 API_DetailType::detailIdStr
Reference ID of the detail/worksheet (Unicode string, UTF-8 encoding). If the text contains a '/' character, then the text is split between the beginning and end marks.
◆ detailName
 API_DetailType::detailName
Name of the detail/worksheet (Unicode string, UTF-8 encoding).
◆ head
 API_DetailType::head
General element header.
◆ horizontalMarker
 API_DetailType::horizontalMarker
Marker symbol is always horizontal?
◆ linkData
 API_DetailType::linkData
The marker link data.
◆ ltypeInd
 API_DetailType::ltypeInd
Line type attribute index of the detail's contour.
◆ markId
 API_DetailType::markId
Guid of the marker symbol.
◆ pen
 API_DetailType::pen
Pen color attribute index of the detail's contour.
◆ poly
 API_DetailType::poly
The clip polygon of the detail/worksheet.
◆ pos
 API_DetailType::pos
Coordinate of the base point. (See remarks)
◆ windOpened
 API_DetailType::windOpened
Side (detail/worksheet) window is opened?